#### Terraform Plan ��
```hcl
[0m[1mdata.aws_iam_policy_document.cert_manager_permissions: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_partition.current: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.permissions_policy: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-075f9054a8bb97b1e][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296][0m
[0m[1mdata.aws_iam_policy_document.permissions_policy: Read complete after 0s [id=3488776268][0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mdata.aws_iam_policy_document.cert_manager_permissions: Read complete after 0s [id=321154789][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799][0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1maws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::022239501643:policy/ExternalDnsPolicy][0m
[0m[1mmodule.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-lab-cluster/cluster][0m
[0m[1mmodule.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.custom[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role.this[0]: Refreshing state... [id=spot_nodes-eks-node-group-20250729154027298600000001][0m
[0m[1mmodule.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002][0m
[0m[1mmodule.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117][0m
[0m[1mmodule.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::022239501643:policy/eks-lab-cluster-cluster-20250729154027305400000003][0m
[0m[1mmodule.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=022239501643][0m
[0m[1mmodule.eks.data.aws_iam_session_context.current[0]: Reading...[0m[0m
[0m[1mmodule.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].data.aws_caller_identity.current: Read complete after 0s [id=022239501643][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002-20250729154027654300000005][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002-20250729154027662700000006][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002-20250729154027644000000004][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=spot_nodes-eks-node-group-20250729154027298600000001-20250729154027707000000007][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=spot_nodes-eks-node-group-20250729154027298600000001-20250729154027745400000009][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=spot_nodes-eks-node-group-20250729154027298600000001-20250729154027729300000008][0m
[0m[1mmodule.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=022239501643][0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...[0m[0m
[0m[1mmodule.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2335649184][0m
[0m[1mmodule.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=84ec1dc0-cbe3-4437-94e5-6887d46d32c4][0m
[0m[1mmodule.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-lab-cluster][0m
[0m[1mmodule.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::022239501643:policy/eks-lab-cluster-cluster-ClusterEncryption2025072915404971350000000d][0m
[0m[1mmodule.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-lab-cluster-cluster-20250729154027304200000002-2025072915405000570000000e][0m
[0m[1mmodule.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0f66cca4b3321079c][0m
[0m[1mmodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04252fc376756582f][0m
[0m[1mmodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-01c32044b41941374][0m
[0m[1mmodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cca2926dd98cc1c5][0m
[0m[1mmodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-00b18fe791c2d3150][0m
[0m[1mmodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0193772631b1ad52f][0m
[0m[1mmodule.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0e393813715091302][0m
[0m[1mmodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-046c8775512d9d0eb][0m
[0m[1mmodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ff47f84032f6c21a][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2744021794][0m
[0m[1mmodule.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2176089151][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-4027046276][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1415084651][0m
[0m[1mmodule.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3077616095][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-4271088000][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3072711406][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3695526873][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-489757534][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3564338376][0m
[0m[1mmodule.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3341762793][0m
[0m[1mmodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-046c8775512d9d0eb1080289494][0m
[0m[1mmodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06bf7a153f305992c][0m
[0m[1mmodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b61278aae9b960fb][0m
[0m[1mmodule.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-lab-cluster][0m
[0m[1mmodule.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::022239501643:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F][0m
[0m[1mmodule.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-046e9137125489bc2,Project][0m
[0m[1mmodule.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci][0m
[0m[1mmodule.eks.time_sleep.this[0]: Refreshing state... [id=2025-07-29T15:47:36Z][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=8524188774829411902][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_launch_template.this[0]: Refreshing state... [id=lt-04b146a3edeef80f8][0m
[0m[1mdata.aws_iam_policy_document.cert_manager_assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_role: Read complete after 0s [id=2706700323][0m
[0m[1mdata.aws_iam_policy_document.cert_manager_assume_role: Read complete after 0s [id=2648103222][0m
[0m[1maws_iam_role.external_dns: Refreshing state... [id=external-dns-role][0m
[0m[1maws_iam_role_policy_attachment.attach: Refreshing state... [id=external-dns-role-2025072915470702880000000f][0m
[0m[1mmodule.eks.module.eks_managed_node_group["spot_nodes"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-lab-cluster:spot_nodes-20250729154743014500000012][0m
[0m[1mmodule.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1maws_eks_access_entry.root_user: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:root][0m
[0m[1maws_eks_access_entry.eks_deployer_user: Refreshing state... [id=eks-lab-cluster:arn:aws:iam::022239501643:user/eks-lab-eks-deployer][0m
[0m[1maws_eks_access_policy_association.root_user_admin: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m
[0m[1maws_eks_access_policy_association.eks_deployer_user_admin: Refreshing state... [id=eks-lab-cluster#arn:aws:iam::022239501643:user/eks-lab-eks-deployer#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.eks.module.eks_managed_node_group["spot_nodes"].aws_eks_node_group.this[0][0m has changed
[0m  [33m~[0m[0m resource "aws_eks_node_group" "this" {
      [32m+[0m[0m arn                    = "arn:aws:eks:eu-west-2:022239501643:nodegroup/eks-lab-cluster/spot_nodes-20250729154743014500000012/7ecc2b6f-20c0-954d-7aea-ca9ca55a288f"
        id                     = "eks-lab-cluster:spot_nodes-20250729154743014500000012"
      [32m+[0m[0m resources              = [
          [32m+[0m[0m {
              [32m+[0m[0m autoscaling_groups              = [
                  [32m+[0m[0m {
                      [32m+[0m[0m name = "eks-spot_nodes-20250729154743014500000012-7ecc2b6f-20c0-954d-7aea-ca9ca55a288f"
                    },
                ]
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ]
      [32m+[0m[0m status                 = "CREATE_FAILED"
        tags                   = {
            "Name"    = "spot_nodes"
            "Project" = "eks-lab"
        }
        [90m# (9 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
  [31m-[0m destroy[0m
[32m+[0m/[31m-[0m create replacement and then destroy[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_eks_access_entry.eks_deployer_user[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_access_entry" "eks_deployer_user" {
        id                = "eks-lab-cluster:arn:aws:iam::022239501643:user/eks-lab-eks-deployer"
      [33m~[0m[0m tags              = {
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_eks_access_entry.root_user[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_access_entry" "root_user" {
        id                = "eks-lab-cluster:arn:aws:iam::022239501643:root"
      [33m~[0m[0m tags              = {
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_iam_policy.cert_manager_iam_policy[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "cert_manager_iam_policy" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "CertManagerPolicy"
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = "route53:ChangeResourceRecordSets"
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "arn:aws:route53:::hostedzone/*"
                      [32m+[0m[0m Sid      = "ChangeRecordsInZones"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m Action   = [
                          [32m+[0m[0m "route53:ListTagsForResource",
                          [32m+[0m[0m "route53:ListResourceRecordSets",
                          [32m+[0m[0m "route53:ListHostedZonesByVPC",
                          [32m+[0m[0m "route53:ListHostedZonesByName",
                          [32m+[0m[0m "route53:ListHostedZones",
                          [32m+[0m[0m "route53:GetHostedZone",
                        ]
                      [32m+[0m[0m Effect   = "Allow"
                      [32m+[0m[0m Resource = "*"
                      [32m+[0m[0m Sid      = "ReadAllZones"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Project" = "eks-lab"
        }
    }

[1m  # aws_iam_role.cert_manager_iam_role[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "cert_manager_iam_role" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRoleWithWebIdentity"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m StringEquals = {
                              [32m+[0m[0m "oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F:aud" = "sts.amazonaws.com"
                              [32m+[0m[0m "oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F:sub" = "system:serviceaccount:cert-manager:cert-manager"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Federated = "arn:aws:iam::022239501643:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = false
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "cert-manager-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Project" = "eks-lab"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # aws_iam_role_policy_attachment.cert_manager_attachment[0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cert_manager_attachment" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "cert-manager-role"
    }

[1m  # module.eks.data.aws_eks_addon_version.this["coredns"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m[0m addon_name         = "coredns"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.29"
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # module.eks.data.aws_eks_addon_version.this["kube-proxy"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m[0m addon_name         = "kube-proxy"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.29"
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # module.eks.data.aws_eks_addon_version.this["vpc-cni"][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_eks_addon_version" "this" {
      [32m+[0m[0m addon_name         = "vpc-cni"
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m kubernetes_version = "1.29"
      [32m+[0m[0m version            = (known after apply)
    }

[1m  # module.eks.data.tls_certificate.this[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "tls_certificate" "this" {
      [32m+[0m[0m certificates = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m url          = "https://oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F"
    }

[1m  # module.eks.aws_cloudwatch_log_group.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/eks/eks-lab-cluster/cluster"
        name              = "/aws/eks/eks-lab-cluster/cluster"
      [33m~[0m[0m tags              = {
            "Name"    = "/aws/eks/eks-lab-cluster/cluster"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (7 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.aws_ec2_tag.cluster_primary_security_group["Project"][0m will be [1m[31mdestroyed[0m
  # (because key ["Project"] is not in for_each map)
[0m  [31m-[0m[0m resource "aws_ec2_tag" "cluster_primary_security_group" {
      [31m-[0m[0m id          = "sg-046e9137125489bc2,Project" [90m-> null[0m[0m
      [31m-[0m[0m key         = "Project" [90m-> null[0m[0m
      [31m-[0m[0m resource_id = "sg-046e9137125489bc2" [90m-> null[0m[0m
      [31m-[0m[0m value       = "eks-lab" [90m-> null[0m[0m
    }

[1m  # module.eks.aws_eks_access_entry.this["cluster_creator"][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_access_entry" "this" {
        id                = "eks-lab-cluster:arn:aws:iam::022239501643:user/eks-lab-github-terraform-ci"
      [33m~[0m[0m tags              = {
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.aws_eks_addon.this["coredns"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m[0m addon_name                  = "coredns"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "eks-lab-cluster"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m preserve                    = true
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "OVERWRITE"
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Project" = "eks-lab"
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.eks.aws_eks_addon.this["kube-proxy"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m[0m addon_name                  = "kube-proxy"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "eks-lab-cluster"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m preserve                    = true
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "OVERWRITE"
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Project" = "eks-lab"
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.eks.aws_eks_addon.this["vpc-cni"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m[0m addon_name                  = "vpc-cni"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "eks-lab-cluster"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m preserve                    = true
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m resolve_conflicts_on_update = "OVERWRITE"
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Project" = "eks-lab"
        }

      [32m+[0m[0m timeouts {}
    }

[1m  # module.eks.aws_eks_cluster.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_eks_cluster" "this" {
        id                            = "eks-lab-cluster"
        name                          = "eks-lab-cluster"
      [33m~[0m[0m tags                          = {
          [31m-[0m[0m "Project"               = "eks-lab" [90m-> null[0m[0m
            "terraform-aws-modules" = "eks"
        }
        [90m# (12 unchanged attributes hidden)[0m[0m

        [90m# (6 unchanged blocks hidden)[0m[0m
    }

[1m  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::022239501643:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/4F5EFA15F6C8CF776E01F768BB67420F"
      [33m~[0m[0m tags            = {
            "Name"    = "eks-lab-cluster-eks-irsa"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
      [33m~[0m[0m thumbprint_list = [
          [31m-[0m[0m "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.aws_iam_policy.cluster_encryption[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_policy" "cluster_encryption" {
        id               = "arn:aws:iam::022239501643:policy/eks-lab-cluster-cluster-ClusterEncryption2025072915404971350000000d"
        name             = "eks-lab-cluster-cluster-ClusterEncryption2025072915404971350000000d"
      [33m~[0m[0m tags             = {
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (8 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.aws_iam_policy.custom[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_policy" "custom" {
        id               = "arn:aws:iam::022239501643:policy/eks-lab-cluster-cluster-20250729154027305400000003"
        name             = "eks-lab-cluster-cluster-20250729154027305400000003"
      [33m~[0m[0m tags             = {
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (8 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.aws_iam_role.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_role" "this" {
        id                    = "eks-lab-cluster-cluster-20250729154027304200000002"
        name                  = "eks-lab-cluster-cluster-20250729154027304200000002"
      [33m~[0m[0m tags                  = {
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (12 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.aws_security_group.cluster[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_security_group" "cluster" {
        id                     = "sg-0f66cca4b3321079c"
        name                   = "eks-lab-cluster-cluster-2025072915403995390000000c"
      [33m~[0m[0m tags                   = {
            "Name"    = "eks-lab-cluster-cluster"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.aws_security_group.node[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_security_group" "node" {
        id                     = "sg-0e393813715091302"
        name                   = "eks-lab-cluster-node-2025072915403994880000000b"
      [33m~[0m[0m tags                   = {
            "Name"                                  = "eks-lab-cluster-node"
          [31m-[0m[0m "Project"                               = "eks-lab" [90m-> null[0m[0m
            "kubernetes.io/cluster/eks-lab-cluster" = "owned"
        }
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # module.vpc.aws_default_network_acl.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_default_network_acl" "this" {
        id                     = "acl-01c32044b41941374"
      [33m~[0m[0m tags                   = {
            "Name"    = "eks-lab-vpc-default"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (6 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # module.vpc.aws_default_route_table.default[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_default_route_table" "default" {
        id                     = "rtb-0cca2926dd98cc1c5"
      [33m~[0m[0m tags                   = {
            "Name"    = "eks-lab-vpc-default"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.vpc.aws_default_security_group.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_default_security_group" "this" {
        id                     = "sg-04252fc376756582f"
        name                   = "default"
      [33m~[0m[0m tags                   = {
            "Name"    = "eks-lab-vpc-default"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (9 unchanged attributes hidden)[0m[0m
    }

[1m  # module.vpc.aws_internet_gateway.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_internet_gateway" "this" {
        id       = "igw-0ff47f84032f6c21a"
      [33m~[0m[0m tags     = {
            "Name"    = "eks-lab-vpc"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # module.vpc.aws_route_table.public[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_route_table" "public" {
        id               = "rtb-046c8775512d9d0eb"
      [33m~[0m[0m tags             = {
            "Name"    = "eks-lab-vpc-public"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (6 unchanged attributes hidden)[0m[0m
    }

[1m  # module.vpc.aws_subnet.public[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_subnet" "public" {
        id                                             = "subnet-0193772631b1ad52f"
      [33m~[0m[0m tags                                           = {
            "Name"                   = "eks-lab-vpc-public-eu-west-2a"
          [31m-[0m[0m "Project"                = "eks-lab" [90m-> null[0m[0m
            "kubernetes.io/role/elb" = "1"
        }
        [90m# (20 unchanged attributes hidden)[0m[0m
    }

[1m  # module.vpc.aws_subnet.public[1][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_subnet" "public" {
        id                                             = "subnet-00b18fe791c2d3150"
      [33m~[0m[0m tags                                           = {
            "Name"                   = "eks-lab-vpc-public-eu-west-2b"
          [31m-[0m[0m "Project"                = "eks-lab" [90m-> null[0m[0m
            "kubernetes.io/role/elb" = "1"
        }
        [90m# (20 unchanged attributes hidden)[0m[0m
    }

[1m  # module.vpc.aws_vpc.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_vpc" "this" {
        id                                   = "vpc-075f9054a8bb97b1e"
      [33m~[0m[0m tags                                 = {
            "Name"    = "eks-lab-vpc"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (19 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.module.eks_managed_node_group["spot_nodes"].aws_eks_node_group.this[0][0m is tainted, so must be [1m[31mreplaced[0m
[0m[32m+[0m/[31m-[0m[0m resource "aws_eks_node_group" "this" {
      [33m~[0m[0m arn                    = "arn:aws:eks:eu-west-2:022239501643:nodegroup/eks-lab-cluster/spot_nodes-20250729154743014500000012/7ecc2b6f-20c0-954d-7aea-ca9ca55a288f" -> (known after apply)
      [33m~[0m[0m disk_size              = 0 -> (known after apply)
      [33m~[0m[0m id                     = "eks-lab-cluster:spot_nodes-20250729154743014500000012" -> (known after apply)
      [33m~[0m[0m instance_types         = [
            "t4g.medium",
          [32m+[0m[0m "c6g.large",
        ]
      [31m-[0m[0m labels                 = {} [90m-> null[0m[0m
      [33m~[0m[0m node_group_name        = "spot_nodes-20250729154743014500000012" -> (known after apply)
      [33m~[0m[0m release_version        = "1.29.15-20250715" -> (known after apply)
      [33m~[0m[0m resources              = [
          [31m-[0m[0m {
              [31m-[0m[0m autoscaling_groups              = [
                  [31m-[0m[0m {
                      [31m-[0m[0m name = "eks-spot_nodes-20250729154743014500000012-7ecc2b6f-20c0-954d-7aea-ca9ca55a288f"
                    },
                ]
                [90m# (1 unchanged attribute hidden)[0m[0m
            },
        ] -> (known after apply)
      [33m~[0m[0m status                 = "CREATE_FAILED" -> (known after apply)
      [33m~[0m[0m tags                   = {
            "Name"    = "spot_nodes"
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (8 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m launch_template {
            id      = "lt-04b146a3edeef80f8"
          [33m~[0m[0m name    = "spot_nodes-20250729154737066200000010" -> (known after apply)
          [33m~[0m[0m version = "1" -> (known after apply)
        }

      [33m~[0m[0m node_repair_config (known after apply)

      [33m~[0m[0m update_config {
          [31m-[0m[0m max_unavailable            = 0 [90m-> null[0m[0m
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.eks.module.eks_managed_node_group["spot_nodes"].aws_iam_role.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_iam_role" "this" {
        id                    = "spot_nodes-eks-node-group-20250729154027298600000001"
        name                  = "spot_nodes-eks-node-group-20250729154027298600000001"
      [33m~[0m[0m tags                  = {
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (12 unchanged attributes hidden)[0m[0m
    }

[1m  # module.eks.module.eks_managed_node_group["spot_nodes"].aws_launch_template.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_launch_template" "this" {
      [33m~[0m[0m default_version                      = 1 -> (known after apply)
        id                                   = "lt-04b146a3edeef80f8"
      [33m~[0m[0m latest_version                       = 1 -> (known after apply)
        name                                 = "spot_nodes-20250729154737066200000010"
      [33m~[0m[0m tags                                 = {
          [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
        }
        [90m# (17 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m tag_specifications {
          [33m~[0m[0m tags          = {
                "Name"    = "spot_nodes"
              [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
            }
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [33m~[0m[0m tag_specifications {
          [33m~[0m[0m tags          = {
                "Name"    = "spot_nodes"
              [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
            }
            [90m# (1 unchanged attribute hidden)[0m[0m
        }
      [33m~[0m[0m tag_specifications {
          [33m~[0m[0m tags          = {
                "Name"    = "spot_nodes"
              [31m-[0m[0m "Project" = "eks-lab" [90m-> null[0m[0m
            }
            [90m# (1 unchanged attribute hidden)[0m[0m
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.eks.module.kms.aws_kms_key.this[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_kms_key" "this" {
        id                                 = "84ec1dc0-cbe3-4437-94e5-6887d46d32c4"
      [33m~[0m[0m tags                               = {
          [31m-[0m[0m "Project"               = "eks-lab" [90m-> null[0m[0m
            "terraform-aws-modules" = "eks"
        }
        [90m# (14 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 7 to add, 22 to change, 2 to destroy.
[0m
```

*Pusher: @JohnMichaelWalker, Action: `pull_request`*